snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ЗаказКлиентаFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаFBS</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистПереукладки</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	РеквизитыТекущегоУзла = ЗначенияРеквизитовОбъекта(ПараметрыСеанса.ЭтотУзел, "ТипУзла");
	
	// ???
	//Кухарь А.Ю. начало
	Если РеквизитыТекущегоУзла.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		если ЭтоНовый()  тогда
			для каждого СтрТЧ из Товары цикл
				СтрТЧ.ИДСтроки=СтрТЧ.НомерСтроки;
			КонецЦикла;
		ИначеЕсли не ОбменДанными.Загрузка и Модифицированность() тогда
			МассСтрок=Товары.НайтиСтроки(Новый Структура("ИДСтроки",0));
			Для каждого СтрМасс из МассСтрок цикл
				СтрМасс.ИДСтроки=СтрМасс.НомерСтроки;
			КонецЦикла;
			
			ТаблицаТовары=Товары.Выгрузить(,"ИДСтроки");
			ТаблицаТовары.Свернуть("ИДСтроки");
			если ТаблицаТовары.Количество()<>Товары.Количество() тогда
				СообщитьИзМодуля("Обнаружены дубли ИДСтроки");
				//отказ=Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Кухарь А.Ю. конец
	
	// Ихсанов Д. А. Начало 12.02.2026
	КонтрольДанныхТабличнойЧастиТовары();
	// Ихсанов Д. А. Конец 12.02.2026
	
	Если ОбменДанными.Загрузка Тогда
		НужноВыгружать=ложь;
		
		Возврат;
	Иначе		
		// Кухарь А.Ю. 27.09.2023 начало
		//если Модифицированность() тогда
		если Модифицированность() или  РеквизитыТекущегоУзла.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
			// Кухарь А.Ю. 27.09.2023 конец
			
			НужноВыгружать=Истина;
		иначе
			НужноВыгружать=Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура - Контроль данных табличной части товары
// Выполняет дифференциацию признаков отмены и фиксирует вычерки
// Ихсанов Д. А. 12.02.2026
//
Процедура КонтрольДанныхТабличнойЧастиТовары()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	// Ихсанов Д. А. Начало 16.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7928
	// https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8007
	// Данная проверка необходима так же в момент загрузки документа, она нужна для избежания расхождений по полям отмены
	// и количества отмененного товара
	ИменаРеквизитовДляПроверки = Новый Массив;
	ИменаРеквизитовДляПроверки.Добавить("Отменен");
	ИменаРеквизитовДляПроверки.Добавить("ВычеркОфис");
	ИменаРеквизитовДляПроверки.Добавить("ВычеркСклад");
	
	ОбменМаркетПлейс.МаркетПлейсы_КонтрольПолейОтменыДокументаЗаказа(ЭтотОбъект, ИменаРеквизитовДляПроверки);
	// Ихсанов Д. А. Конец 16.12.2025
	
	ИмяТабичнойЧастиДляКонтроля = "Товары";
	
	РеквизитыДокумента = ЗначенияРеквизитовОбъекта(Ссылка, ИмяТабичнойЧастиДляКонтроля);
	Если РеквизитыДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧастьТовары = РеквизитыДокумента[ИмяТабичнойЧастиДляКонтроля].Выгрузить();
	
	// Ихсанов Д. А. Начало 12.02.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8869
	СформироватьУведомлениеОВычеркахНаСторонеСклада(ТабличнаяЧастьТовары);
	// Ихсанов Д. А. Конец 12.02.2025
	// Ихсанов Д. А. Начало 15.05.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-175
	СформироватьУведомлениеОВычеркахНаСторонеОфиса(ТабличнаяЧастьТовары);
	СформироватьУведомлениеОВычеркахНаСторонеСайта(ТабличнаяЧастьТовары);
	// Ихсанов Д. А. Конец 15.05.2025
	
КонецПроцедуры // КонтрольДанныхТабличнойЧастиТовары()

// Процедура - Сформировать уведомление о вычерках на стороне склада
// Ставит в очередь письмо с уведомлением о появлении вычерка по документу
// Ихсанов Д. А. 12.02.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8869
// 
// Параметры:
//  ТабличнаяЧастьТовары - ТабличнаяЧасть - Табличная часть товары
Процедура СформироватьУведомлениеОВычеркахНаСторонеСклада(ТабличнаяЧастьТовары)
	
	// Ихсанов Д. А. Начало 11.02.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8869
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВычеркСклад", Истина);
	
	МассивСтрокСообщения = Новый Массив;
	НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для каждого СтрокаТабличнойЧасти из НайденныеСтроки Цикл
			СтрокаТабличнойЧастиСсылка = ТабличнаяЧастьТовары.Найти(СтрокаТабличнойЧасти.НомерЗаказа, "НомерЗаказа");
			Если СтрокаТабличнойЧастиСсылка <> Неопределено И Не СтрокаТабличнойЧастиСсылка.ВычеркСклад Тогда
				МассивСтрокСообщения.Добавить(СтрШаблон("Был помечен к вычерку товар %1, по заказу %2 (%3) в количестве 1 шт. Документ %4.",
					СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.НомерЗаказа, СтрокаТабличнойЧасти.РИД, ДокОснование));;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СтрокаСписокПолучателей = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(
		ОбменМаркетПлейсПИ.ПолучитьИнтернетМагазин(Контрагент), "ПолучателиУведомленийВитрина");
	Если МассивСтрокСообщения.Количество() > 0 И СтрокаСписокПолучателей <> Неопределено Тогда
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.ЗагрузитьЗначения(СтрРазделить(СтрокаСписокПолучателей, ","));
		
		Если СписокПолучателей.Количество() > 0 Тогда
			СформироватьВнутреннееУведомление(СписокПолучателей, СтрСоединить(МассивСтрокСообщения, Символы.ПС),
				СтрШаблон("%1. Товары помечены к вычерку на стороне склада", ОбменМаркетПлейсПИ.ПолучитьИнтернетМагазин(Контрагент)),,,,
				РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
					Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуRobot).Логин);
		КонецЕсли;
	КонецЕсли;
	// Ихсанов Д. А. Конец 11.02.2025
	
КонецПроцедуры // СформироватьУведомлениеОВычеркахНаСторонеСклада()

// Процедура - Сформировать уведомление о вычерках на стороне офиса
// Ставит в очередь письмо с уведомлением о появлении вычерка по документу
// Ихсанов Д. А. 15.05.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-175
// 
// Параметры:
//  ТабличнаяЧастьТовары - ТабличнаяЧасть - Табличная часть товары
Процедура СформироватьУведомлениеОВычеркахНаСторонеОфиса(ТабличнаяЧастьТовары)
	
	// Ихсанов Д. А. Начало 15.05.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-175
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВычеркОфис", Истина);
	
	МассивСтрокСообщения = Новый Массив;
	НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для каждого СтрокаТабличнойЧасти из НайденныеСтроки Цикл
			СтрокаТабличнойЧастиСсылка = ТабличнаяЧастьТовары.Найти(СтрокаТабличнойЧасти.НомерЗаказа, "НомерЗаказа");
			Если СтрокаТабличнойЧастиСсылка <> Неопределено И Не СтрокаТабличнойЧастиСсылка.ВычеркОфис Тогда
				МассивСтрокСообщения.Добавить(СтрШаблон("Был помечен к вычерку товар %1, по заказу %2 (%3) в количестве 1 шт. Документ %4.",
					СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.НомерЗаказа, СтрокаТабличнойЧасти.РИД, ДокОснование));;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 {
	Если МассивСтрокСообщения.Количество() > 0 Тогда
		
		ПроверитьОбновитьНакладную();
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 }

	СтрокаСписокПолучателей = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(
		ОбменМаркетПлейсПИ.ПолучитьИнтернетМагазин(Контрагент), "ПолучателиУведомленийВычеркиОфис");
	Если МассивСтрокСообщения.Количество() > 0 И СтрокаСписокПолучателей <> Неопределено Тогда
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.ЗагрузитьЗначения(СтрРазделить(СтрокаСписокПолучателей, ","));
		
		Если СписокПолучателей.Количество() > 0 Тогда
			СформироватьВнутреннееУведомление(СписокПолучателей, СтрСоединить(МассивСтрокСообщения, Символы.ПС),
				СтрШаблон("%1. Товары помечены к вычерку на стороне офиса", ОбменМаркетПлейсПИ.ПолучитьИнтернетМагазин(Контрагент)),,,,
				РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
					Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуRobot).Логин);
		КонецЕсли;
	КонецЕсли;
	// Ихсанов Д. А. Конец 15.05.2026
	
КонецПроцедуры // СформироватьУведомлениеОВычеркахНаСторонеСклада()

// Процедура - Сформировать уведомление о вычерках на стороне сайта
// Ставит в очередь письмо с уведомлением о появлении вычерка по документу
// Ихсанов Д. А. 15.05.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-175
// 
// Параметры:
//  ТабличнаяЧастьТовары - ТабличнаяЧасть - Табличная часть товары
Процедура СформироватьУведомлениеОВычеркахНаСторонеСайта(ТабличнаяЧастьТовары)
	
	// Ихсанов Д. А. Начало 15.05.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-175
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВычеркОфис", Ложь);
	ПараметрыОтбора.Вставить("ВычеркСклад", Ложь);
	ПараметрыОтбора.Вставить("Отменен", Истина);
	
	МассивСтрокСообщения = Новый Массив;
	НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для каждого СтрокаТабличнойЧасти из НайденныеСтроки Цикл
			СтрокаТабличнойЧастиСсылка = ТабличнаяЧастьТовары.Найти(СтрокаТабличнойЧасти.НомерЗаказа, "НомерЗаказа");
			Если СтрокаТабличнойЧастиСсылка <> Неопределено И Не СтрокаТабличнойЧастиСсылка.Отменен Тогда
				МассивСтрокСообщения.Добавить(СтрШаблон("Был отменен клиентом товар %1, по заказу %2 (%3) в количестве 1 шт. Документ %4.",
					СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.НомерЗаказа, СтрокаТабличнойЧасти.РИД, ДокОснование));;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 {
	Если МассивСтрокСообщения.Количество() > 0 Тогда
		
		ПроверитьОбновитьНакладную();
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 }

	СтрокаСписокПолучателей = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(
		ОбменМаркетПлейсПИ.ПолучитьИнтернетМагазин(Контрагент), "ПолучателиУведомленийВычеркиСайт");
	Если МассивСтрокСообщения.Количество() > 0 И СтрокаСписокПолучателей <> Неопределено Тогда
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.ЗагрузитьЗначения(СтрРазделить(СтрокаСписокПолучателей, ","));
		
		Если СписокПолучателей.Количество() > 0 Тогда
			СформироватьВнутреннееУведомление(СписокПолучателей, СтрСоединить(МассивСтрокСообщения, Символы.ПС),
				СтрШаблон("%1. Товары отменены клиентом", ОбменМаркетПлейсПИ.ПолучитьИнтернетМагазин(Контрагент)),,,,
				РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
					Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуRobot).Логин);
		КонецЕсли;
	КонецЕсли;
	// Ихсанов Д. А. Конец 15.05.2026
	
КонецПроцедуры // СформироватьУведомлениеОВычеркахНаСторонеСклада()

// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26
Процедура ПроверитьОбновитьНакладную()
	
	Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.Склад Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекСостояние = ПолучитьРеквизитШапки(ДокОснование, "СостояниеНакладной", "Документ");
	
	Если ТекСостояние = Перечисления.СостоянияНакладной.ПолученоСкладом 
		Или ТекСостояние = Перечисления.СостоянияНакладной.СформированыЗаданияНабора
		Или ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеНабора 
		Или ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеПереукладки Тогда
		
		ЗаписатьЗначениеВРеквизитыДокументов(Истина, ДокОснование, "ОбновитьНакладнуюПоЗаказу");
	
	КонецЕсли;
	
	Если ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ПланНабора.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ПланНабора КАК ПланНабора
		               |ГДЕ
		               |	ПланНабора.ДокОснование = &ДокОснование
		               |	И НЕ ПланНабора.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ДокОснование", ДокОснование); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ПН = Выборка.Ссылка;
			
			ПН_Объект = ПН.ПолучитьОбъект();
			
			Для Каждого Стр Из ПН_Объект.тБрэндов Цикл
				
				Стр.Состояние = Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
				
			КонецЦикла;
			
			ПН_Объект.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
			
			ПН_Объект.ОбновитьСостоянияЗаявокНабора(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти
